testing/ab_testing.txt
ab -n 10000 -c 100 -p 'post.txt' -T 'application/json' 'http://localhost:8501/v1/models/url:predict'

This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8501

Document Path:          /v1/models/url:predict
Document Length:        83 bytes

Concurrency Level:      100
Time taken for tests:   0.728 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      1430000 bytes
Total body sent:        160800000
HTML transferred:       830000 bytes
Requests per second:    13729.72 [#/sec] (mean)
Time per request:       7.283 [ms] (mean)
Time per request:       0.073 [ms] (mean, across all concurrent requests)
Transfer rate:          1917.33 [Kbytes/sec] received
                        215599.50 kb/s sent
                        217516.84 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1       4
Processing:     1    7   7.4      5     100
Waiting:        1    6   7.4      5     100
Total:          2    7   7.4      6     101

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      7
  80%      8
  90%      9
  95%     11
  98%     29
  99%     49
 100%    101 (longest request)

ab -n 100000 -c 1000 -p 'post.txt' -T 'application/json' 'http://localhost:8501/v1/models/url:predict'

This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8501

Document Path:          /v1/models/url:predict
Document Length:        83 bytes

Concurrency Level:      1000
Time taken for tests:   7.285 seconds
Complete requests:      100000
Failed requests:        79
   (Connect: 0, Receive: 0, Length: 79, Exceptions: 0)
Non-2xx responses:      99921
Total transferred:      14288703 bytes
Total body sent:        1608000000
HTML transferred:       8293443 bytes
Requests per second:    13726.88 [#/sec] (mean)
Time per request:       72.850 [ms] (mean)
Time per request:       0.073 [ms] (mean, across all concurrent requests)
Transfer rate:          1915.42 [Kbytes/sec] received
                        215554.90 kb/s sent
                        217470.32 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.6      2      21
Processing:     3   63 215.1     21    3053
Waiting:        0   61 213.4     20    3051
Total:          4   65 215.3     23    3056

Percentage of the requests served within a certain time (ms)
  50%     23
  66%     27
  75%     29
  80%     31
  90%     38
  95%     58
  98%   1044
  99%   1053
 100%   3056 (longest request)


ab -n 1000000 -c 100 -p 'post.txt' -T 'application/json' 'http://localhost:8501/v1/models/url:predict'

This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8501

Document Path:          /v1/models/url:predict
Document Length:        83 bytes

Concurrency Level:      100
Time taken for tests:   66.555 seconds
Complete requests:      1000000
Failed requests:        0
Non-2xx responses:      1000000
Total transferred:      143000000 bytes
Total body sent:        16080000000
HTML transferred:       83000000 bytes
Requests per second:    15025.26 [#/sec] (mean)
Time per request:       6.655 [ms] (mean)
Time per request:       0.067 [ms] (mean, across all concurrent requests)
Transfer rate:          2098.25 [Kbytes/sec] received
                        235943.54 kb/s sent
                        238041.79 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.7      1       8
Processing:     0    6   2.3      5      37
Waiting:        0    5   2.2      5      36
Total:          1    7   2.3      6      37

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%      8
  90%     10
  95%     11
  98%     13
  99%     14
 100%     37 (longest request)


ab -n 1000000 -c 1000 -p 'post.txt' -T 'application/json' 'http://localhost:8501/v1/models/url:predict'

This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8501

Document Path:          /v1/models/url:predict
Document Length:        83 bytes

Concurrency Level:      1000
Time taken for tests:   65.672 seconds
Complete requests:      1000000
Failed requests:        319
   (Connect: 0, Receive: 0, Length: 319, Exceptions: 0)
Non-2xx responses:      999681
Total transferred:      142954383 bytes
Total body sent:        16080000000
HTML transferred:       82973523 bytes
Requests per second:    15227.25 [#/sec] (mean)
Time per request:       65.672 [ms] (mean)
Time per request:       0.066 [ms] (mean, across all concurrent requests)
Transfer rate:          2125.78 [Kbytes/sec] received
                        239115.37 kb/s sent
                        241241.15 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   2.4      2      23
Processing:     1   62 222.1     22    7292
Waiting:        0   61 221.4     21    7292
Total:          2   65 222.1     25    7298

Percentage of the requests served within a certain time (ms)
  50%     25
  66%     28
  75%     31
  80%     32
  90%     37
  95%     43
  98%   1044
  99%   1053
 100%   7298 (longest request)